; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-4nodes-1000size-4degree-100mindistance-2trucks-5packages-406seed

(define (problem transport-two-cities-sequential-4nodes-1000size-4degree-100mindistance-2trucks-5packages-406seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 426,802 -> 431,950
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 15)
  ; 431,950 -> 426,802
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 15)
  ; 404,589 -> 431,950
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 37)
  ; 431,950 -> 404,589
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 37)
  ; 404,589 -> 426,802
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 22)
  ; 426,802 -> 404,589
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 22)
  ; 309,648 -> 431,950
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 33)
  ; 431,950 -> 309,648
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 33)
  ; 309,648 -> 426,802
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 20)
  ; 426,802 -> 309,648
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 20)
  ; 309,648 -> 404,589
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 12)
  ; 404,589 -> 309,648
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 12)
  ; 2119,438 -> 2315,85
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 41)
  ; 2315,85 -> 2119,438
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 41)
  ; 2220,626 -> 2315,85
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 55)
  ; 2315,85 -> 2220,626
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 55)
  ; 2220,626 -> 2119,438
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 22)
  ; 2119,438 -> 2220,626
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 22)
  ; 2402,423 -> 2315,85
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 35)
  ; 2315,85 -> 2402,423
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 35)
  ; 2402,423 -> 2119,438
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 29)
  ; 2119,438 -> 2402,423
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 29)
  ; 2402,423 -> 2220,626
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 28)
  ; 2220,626 -> 2402,423
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 28)
  ; 404,589 <-> 2119,438
  (road city-1-loc-3 city-2-loc-2)
  (= (road-length city-1-loc-3 city-2-loc-2) 173)
  (road city-2-loc-2 city-1-loc-3)
  (= (road-length city-2-loc-2 city-1-loc-3) 173)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-2)
  (at package-3 city-1-loc-2)
  (at package-4 city-1-loc-2)
  (at package-5 city-1-loc-1)
  (at truck-1 city-2-loc-1)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-4)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-3)
  (at package-2 city-2-loc-2)
  (at package-3 city-2-loc-2)
  (at package-4 city-2-loc-1)
  (at package-5 city-2-loc-4)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 5
2. (drive truck-1 city-2-loc-2 city-1-loc-3)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-1-loc-3)
   goals met: 0 of 5
3. (drive truck-1 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 5
4. (pick-up truck-1 city-1-loc-2 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-1-loc-2) (capacity truck-1 capacity-3)
   added: (in package-4 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 5
5. (pick-up truck-1 city-1-loc-2 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-1-loc-2) (capacity truck-1 capacity-2)
   added: (in package-3 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 5
6. (pick-up truck-1 city-1-loc-2 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-1-loc-2) (capacity truck-1 capacity-1)
   added: (in package-2 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 5
7. (drive truck-1 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-3)
   goals met: 0 of 5
8. (drive truck-1 city-1-loc-3 city-2-loc-2)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 5
9. (drop truck-1 city-2-loc-2 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-0)
   added: (at package-3 city-2-loc-2) (capacity truck-1 capacity-1)
   goals met: 1 of 5
10. (drop truck-1 city-2-loc-2 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-2-loc-2) (capacity truck-1 capacity-2)
   goals met: 2 of 5
11. (drive truck-1 city-2-loc-2 city-1-loc-3)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-1-loc-3)
   goals met: 2 of 5
12. (drive truck-1 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-1)
   goals met: 2 of 5
13. (pick-up truck-1 city-1-loc-1 package-5 capacity-1 capacity-2)
   deleted: (at package-5 city-1-loc-1) (capacity truck-1 capacity-2)
   added: (in package-5 truck-1) (capacity truck-1 capacity-1)
   goals met: 2 of 5
14. (pick-up truck-1 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 2 of 5
15. (drive truck-1 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-3)
   goals met: 2 of 5
16. (drive truck-1 city-1-loc-3 city-2-loc-2)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-2-loc-2)
   goals met: 2 of 5
17. (drive truck-1 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-1)
   goals met: 2 of 5
18. (drop truck-1 city-2-loc-1 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-0)
   added: (at package-4 city-2-loc-1) (capacity truck-1 capacity-1)
   goals met: 3 of 5
19. (drive truck-1 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-3)
   goals met: 3 of 5
20. (drop truck-1 city-2-loc-3 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-1)
   added: (at package-1 city-2-loc-3) (capacity truck-1 capacity-2)
   goals met: 4 of 5
21. (drive truck-1 city-2-loc-3 city-2-loc-4)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-4)
   goals met: 4 of 5
22. (drop truck-1 city-2-loc-4 package-5 capacity-2 capacity-3)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-2)
   added: (at package-5 city-2-loc-4) (capacity truck-1 capacity-3)
   goals met: 5 of 5
